src/DataProcessors/Scan_РМДилера/Scan_РМДилера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_РМДилера</name>
</mdclass:DataProcessor>

src/InformationRegisters/Scan_КомпанииПользователей/Scan_КомпанииПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КомпанииПользователей</name>
  <attributes>
    <name>ПользовательАвтор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Scan_ЗапросНаНадстройки/Scan_ЗапросНаНадстройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗапросНаНадстройки</name>
  <basedOn>Catalog.Scan_СоглашенияОПоставке</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереданВОтделПланированияПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыУслугиРаботы</name>
    <attributes>
      <name>ТоварУслуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаркаПродукта</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСпецификацииПоЦС</name>
      <comment>Номер спецификации по ценовому соглашению</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дилер</name>
      <type>
        <types>CatalogRef.Scan_Компании</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераЗаказовНаЗавод</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераЗаказов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Scan_Компании/Scan_Компании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Компании</name>
  <predefined>
    <items>
      <name>СканияРусь</name>
      <description>Скания Русь</description>
    </items>
  </predefined>
  <attributes>
    <name>DealerID_COW</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДилера</name>
    <type>
      <types>EnumRef.Scan_ВидыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ГруппыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДилерАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДилера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйСклад</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_СтатусыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыДилеров</name>
    <type>
      <types>CatalogRef.Scan_ТипыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ФормыКомпаний</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РегионыОтветственности</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Scan_Регионы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеМаркиДилера</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/Scan_РМДилера/Forms/ФормаЗапросНаНадстройки/Module.bsl
// Rarus tenkam 14.10.2021 mantis 17822 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заявка") Тогда
		СоглашениеОПоставке = Параметры.Заявка;
	КонецЕсли;
	Дилер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СоглашениеОПоставке, "Дилер");
	
	ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");

КонецПроцедуры

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТоварыУслугиРаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
		
	Если НоваяСтрока Тогда
		ТоварыУслугиРаботыЗаполнитьНовуюСтрокуНаСервере(Элементы.ТоварыУслугиРаботы.ТекущаяСтрока);
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
Процедура ПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтатусДействующая = ПолучитьСтатусКомпанииДействующая();
	ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных;
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ФиксированныеНастройки.Отбор, "СтатусыКомпаний", ВидСравненияКомпоновкиДанных.Равно, СтатусДействующая,,Истина);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", ФиксированныеНастройки);
		
	ОткрытьФорму("Справочник.Scan_Компании.ФормаВыбора", ПараметрыФормы, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДилерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущийПользователь = ПользователиКлиент.ТекущийПользователь();
	ПользовательСотрудник = Scan_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "ПользовательСотрудник");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УстановитьРежимОтображенияСписок", Истина);
	
	Если НЕ ПользовательСотрудник Тогда 
		МассивКомпаний = ПолучитьКомпанииПользователя();
		
		ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных;
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ФиксированныеНастройки.Отбор, "Ссылка", ВидСравненияКомпоновкиДанных.ВСписке, МассивКомпаний,,Истина);
		ПараметрыФормы.Вставить("ФиксированныеНастройки", ФиксированныеНастройки);
	КонецЕсли;	
		
	ОткрытьФорму("Справочник.Scan_Компании.ФормаВыбора", ПараметрыФормы, Элемент);	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаСервере
Функция СоздатьНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	
	ДокОбъект = Документы.Scan_ЗапросНаНадстройки.СоздатьДокумент();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ДокОбъект.Автор                 = ТекущийПользователь;
	ДокОбъект.ВалютаДокумента       = ВалютаДокумента;
	ДокОбъект.ДатаСоздания          = ТекущаяДатаСеанса();
	ДокОбъект.Дата                  = ТекущаяДатаСеанса();
	ДокОбъект.Менеджер              = ТекущийПользователь;
	ДокОбъект.Организация           = ТекущийПользователь.Организация;
	ДокОбъект.ПодразделениеКомпании = ТекущийПользователь.ПодразделениеОрганизации;
	
	
	ДокОбъект.СоглашениеОПоставке = СоглашениеОПоставке;
	ДокОбъект.Поставщик = Поставщик;
	ДокОбъект.Комментарий = Комментарий;
	ДокОбъект.ПереданВОтделПланированияПродаж = ПереданВОтделПланированияПродаж;
	
	Для Каждого ТекСтрока Из ТоварыУслугиРаботы Цикл
		НоваяСтрокаДок = ДокОбъект.ТоварыУслугиРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДок, ТекСтрока);
		НоваяСтрокаДок.Дилер = Дилер;  		
	КонецЦикла;
	
	Попытка
		ДокОбъект.Записать();
		Возврат Истина;
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Не удалось записать документ. %1'; en = 'Unable to save document.%1'"),,,,,ОписаниеОшибки());
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура Создать(Команда)
	Если ПроверитьЗаполнениеПолей() Тогда
		Если СоздатьНаСервере() Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	Отказ = Ложь;
	//Если НЕ ЗначениеЗаполнено(Дилер) Тогда
	//	Сообщить(НСтр("ru = 'Дилер не заполнен.'; en = 'Select dealer'"));
	//	Отказ = Истина;
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
	//	Сообщить(НСтр("ru = 'Поставщик не заполнен.'; en = 'Select dealer'"));
	//	Отказ = Истина;
	//КонецЕсли;
	
	Для Индекс = 0 по ТоварыУслугиРаботы.Количество()-1 Цикл
		СтрокаТовар = ТоварыУслугиРаботы.Получить(Индекс);
		НомерСтроки = Индекс + 1;
		Если Не ЗначениеЗаполнено(СтрокаТовар.ТоварУслуга) Тогда
			ВывестиСообщениеПол(НСтр("ru = 'В строке %1 не заполнено описание товара.'; en = 'Select product decription'"),,,,,НомерСтроки);
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТовар.МаркаПродукта) Тогда
			ВывестиСообщениеПол(НСтр("ru = 'В строке %1 не заполнен производитель.'; en = 'Select product decription'"),,,,,НомерСтроки);
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТовар.Количество) Тогда
			ВывестиСообщениеПол(НСтр("ru = 'В строке %1 не заполнено количество.'; en = 'Select product decription'"),,,,,НомерСтроки);
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТовар.Цена) Тогда
			ВывестиСообщениеПол(НСтр("ru = 'В строке %1 не заполнена цена.'; en = 'Select product decription'"),,,,,НомерСтроки);
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТовар.Валюта) Тогда
			ВывестиСообщениеПол(НСтр("ru = 'В строке %1 не заполнена валюта.'; en = 'Select product decription'"),,,,,НомерСтроки);
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТовар.КомментарийЦены) Тогда
			ВывестиСообщениеПол(НСтр("ru = 'В строке %1 не заполнен комментарий к цене.'; en = 'Select product decription'"),,,,,НомерСтроки);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат НЕ Отказ;
КонецФункции

&НаСервере
Процедура ТоварыУслугиРаботыЗаполнитьНовуюСтрокуНаСервере(ИдентификаторСтроки)
	
	СтрокаТаблицы = ТоварыУслугиРаботы.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если СтрокаТаблицы <> Неопределено Тогда
		СтрокаТаблицы.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		
		Если СтрокаТаблицы.Количество = 0 Тогда
			СтрокаТаблицы.Количество = 1;
		КонецЕсли;
		Если СтрокаТаблицы.Валюта.Пустая() Тогда
			СтрокаТаблицы.Валюта = ВалютаДокумента;
		КонецЕсли;
				
		//Запрос = Новый Запрос;
		//Запрос.УстановитьПараметр("СоглашениеОПоставке", СоглашениеОПоставке);
		//Запрос.Текст = "ВЫБРАТЬ
		//|	Scan_СоглашенияОПоставке.Дилер КАК Дилер
		//|ИЗ
		//|	Справочник.Scan_СоглашенияОПоставке КАК Scan_СоглашенияОПоставке
		//|ГДЕ
		//|	Scan_СоглашенияОПоставке.Ссылка = &СоглашениеОПоставке
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	Scan_ВзаимосвязьИзделийИЗаказовСрезПоследних.ЗаказНаЗавод КАК ЗаказНаЗавод
		//|ИЗ
		//|	РегистрСведений.Scan_ВзаимосвязьИзделийИЗаказов.СрезПоследних(
		//|			,
		//|			Изделие В
		//|				(ВЫБРАТЬ
		//|					Справочник.Scan_СоглашенияОПоставке.СписокПродуктов.Продукт
		//|				ИЗ
		//|					Справочник.Scan_СоглашенияОПоставке.СписокПродуктов
		//|				ГДЕ
		//|					Справочник.Scan_СоглашенияОПоставке.СписокПродуктов.Ссылка = &СоглашениеОПоставке)) КАК Scan_ВзаимосвязьИзделийИЗаказовСрезПоследних";
		//РезультатыЗапроса = Запрос.ВыполнитьПакет();
		//
		//Если ПустаяСтрока(СтрокаТаблицы.НомераЗаказов) Тогда
		//	Если Не РезультатыЗапроса[1].Пустой() Тогда
		//		ТаблицаРезультата = РезультатыЗапроса[1].Выгрузить();
		//		
		//		СтрокаТаблицы.НомераЗаказов = СтрСоединить(ТаблицаРезультата.ВыгрузитьКолонку("ЗаказНаЗавод"), ",");
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКомпанииПользователя()
	
	КомпанииСКонтрагентами = РегистрыСведений.Scan_КомпанииПользователей.ПолучитьКомпаниюДилераПользователя(ПараметрыСеанса.ТекущийПользователь);
	КомпанииПользователя   = КомпанииСКонтрагентами.ВыгрузитьКолонку("Компания");
	
	Возврат КомпанииПользователя;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатусКомпанииДействующая()
	Возврат Справочники.Scan_СтатусыКомпаний.НайтиПоНаименованию("Действующая");	
КонецФункции

#КонецОбласти
// Rarus tenkam 14.10.2021 mantis 17822 ---
